# Metricas de tendencia central
- Media
- Mediana
- Moda
- Variancia
- Desvio padrão

In [20]:
frutas = {
    'fruta':['banana', 'uva', 'maça', 'kiwi', 'morango', 'abacaxi', 'melão', 'pêra'], 
'lote':[5,3,4,7,7,10,10,10],
'valor(u)':[50.85, 10.50, 8.00, 9.99, 10.85, 100.50, 8.80, 99.99,]
}
print(type(frutas))
print(frutas)
display(df)

<class 'dict'>
{'fruta': ['banana', 'uva', 'maça', 'kiwi', 'morango', 'abacaxi', 'melão', 'pêra'], 'lote': [5, 3, 4, 7, 7, 10, 10, 10], 'valor(u)': [50.85, 10.5, 8.0, 9.99, 10.85, 100.5, 8.8, 99.99]}

     fruta  lote  valor(u)
0   banana     5     50.85
1      uva     3     10.50
2     maça     4      8.00
3     kiwi     7      9.99
4  morango     7     10.85
5  abacaxi    10    100.50
6    melão    10      8.80
7     pêra    10     99.99

In [21]:
import pandas as pd

In [22]:
# converter dicionário em dataframe
df = pd.DataFrame(frutas)
print(type(df))
print(df)
display(df)

<class 'pandas.core.frame.DataFrame'>
     fruta  lote  valor(u)
0   banana     5     50.85
1      uva     3     10.50
2     maça     4      8.00
3     kiwi     7      9.99
4  morango     7     10.85
5  abacaxi    10    100.50
6    melão    10      8.80
7     pêra    10     99.99

     fruta  lote  valor(u)
0   banana     5     50.85
1      uva     3     10.50
2     maça     4      8.00
3     kiwi     7      9.99
4  morango     7     10.85
5  abacaxi    10    100.50
6    melão    10      8.80
7     pêra    10     99.99

In [23]:
df['fruta']

0     banana
1        uva
2       maça
3       kiwi
4    morango
5    abacaxi
6      melão
7       pêra
Name: fruta, dtype: object

In [24]:
df[['lote', 'valor(u)']]

   lote  valor(u)
0     5     50.85
1     3     10.50
2     4      8.00
3     7      9.99
4     7     10.85
5    10    100.50
6    10      8.80
7    10     99.99

In [27]:
colunas = ['fruta', 'lote']

df_sem_valor = df[colunas]

df_sem_valor

     fruta  lote
0   banana     5
1      uva     3
2     maça     4
3     kiwi     7
4  morango     7
5  abacaxi    10
6    melão    10
7     pêra    10

In [28]:
print(type(df['lote']))

<class 'pandas.core.series.Series'>

In [ ]:
# Média
df['lote'].mean()

In [ ]:
# Mediana
df['lote'].median()

In [33]:
# Moda
df['lote'].mode()

0    10
Name: lote, dtype: int64

In [34]:
# Variancia
df['lote'].var()

np.float64(8.0)

In [ ]:
# Desvio padrão / standard
df['lote'].std(ddof=1)

np.float64(2.8284271247461903)

In [40]:
mean = df['lote'].mean()
median = df['lote'].median()
mode = df['lote'].mode()
var = df['lote'].var()
std = df['lote'].std()

print(f'Media: {mean}')
print(f'Mediana: {median}')
print(f'Moda: {mode}')
print(f'Variação: {var}')
print(f'Desvio Padrão: {std}')

Media: 7.0
Mediana: 7.0
Moda: 0    10
Name: lote, dtype: int64
Variação: 8.0
Desvio Padrão: 2.8284271247461903